[
    {
        "username": "Wade Kimpton",
        "company": "Vodafone",
        "like_count": 1,
        "message": "If I could give them zero stars I would. Literally the most uncaring, inept business in NZ. They have Literally stole money from me. I took out phone insure on a phone I brought from the US, vodafone was aware of this and still sold me Phone Insure, when it came time to collect told me it wasn't their problem it was Chubbs issue, Chubb said Vodafone shouldn't have accepted payment.Outcome, over a year of paying for insurance i can't use and won't be refunded.Imagine if I didn't pay my bill. Disgusting behavior from a NZ company."
    },
    {
        "username": "Private",
        "company": "Vodafone",
        "like_count": 1,
        "message": "I can’t be bothered going into detail but this company is a red flag I’ve been fighting for money they owe now for 3 months they just like to mess with your head PLEASE anyone thinking of joining think twice read reviews I give them a big fat 0"
    },
    {
        "username": "Munckinontour",
        "company": "Vodafone",
        "like_count": 1,
        "message": "I wish these reviews were better communicated online. Vodafone really is the worst in every aspect of customer service. Impossible to speak to anyone, impossible to get issues resolved. I could go on about my frustrations in detail. You will waste a huge amount of your valuable time being with Vodafone. Put simply NEVER USE VODAFONE."
    },
    {
        "username": "Jim Waite",
        "company": "Vodafone",
        "like_count": 1,
        "message": "My wife and I arrived in NZ during covid pandemic. We arrived at the MIQ hotel in Auckland city. We didn't have a NZ sim card so were given a Vodafone sim.We attempted to activate it by phone and it didn't work. We phoned the 777 number but were kept waiting for 30 minutes before we hung up.We won't activate it and will only use to receive sms. We will go with another more reliable company.Vodafone, you didn't lose two customers, you lost two prospective customers."
    },
    {
        "username": "August Du",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Don't recommend this business for several reasons. 1) their packages are pricy. For the same broadband Fiber 100, they sell $80 while some other companies sell Fibre 300 at $79 with 4 months free. They won't show you the package on your invoice so you won't know it. 2) They charge you a late payment fee ($16+GST)while at the same time they stop your internet until they receive your payment. 3)the customer service is inconsistent as they outsource that to some other countries. Always took long time to sort out the issues. 4) The App really sucks and confusing. 5) No way/Hard to check your own account online. Needs a lot of information but has no idea of where to find them. Very confusing. Never seen a business doing service like this."
    },
    {
        "username": "Charly Smith",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Wish I never moved to Vodafone, internet is so slow I can’t even watch videos or take a video call with on my data. Might as well not have any data at all how slow it is"
    },
    {
        "username": "Gill",
        "company": "Vodafone",
        "like_count": 5,
        "message": "Wednesday went into Vodafone Rotorua I was apprehensive as the Tauranga Crossing store staff are rude , patronising and completely disinterested in helping even though I have been with Vodafone for years . The difference in the Rotorua store was incredible I ended up being helped by three different young men who went above and beyond. I also noticed they treated other customers with the same delightful manner .Thank you Rotorua vodafone you should go to Tauranga and teach them some customer skills👍"
    },
    {
        "username": "Sonya D",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Pathetic service! You would just go in circles with your problems.I signed up recently for my broadband, then they haven't sent me the bill through (yes, they had my mobile number and yet I was not contacted) plus they must have the wrong email entered.Called back, was told 3 different things by 3 different people, no result.I paid in full even whatever was not due, they said you have to wait for 24 hrs. However, a person earlier said, he will do it straight away!Lot's of people said, don't chose Vodafone yet I did! Should have listened! Worst service ever"
    },
    {
        "username": "Candycane",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Very trash coulden't even watch the Superbowl because the wifi kept disconnecting and I can't even connect to the 2nd network they gave us this service sucks!"
    },
    {
        "username": "David Leegwater",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Another fake Shalini duvvuruFake person leaving a fake review, Vodafone is trash"
    },
    {
        "username": "Patricia",
        "company": "Vodafone",
        "like_count": 1,
        "message": "After months of problems with Vodafone TV, and several on-line and phone discussions, it stopped working altogether.  A helpful call centre person said he'd send me a new box if I signed up for 12 months.  Declined to do that and insisted I be issued with a device that provides the service I'm paying for.  New box received the next day and was told I would get a credit on my next bill for loss of service.  Instead on my next bill I got a charge of $27.93 for other calls and services\" on my home phone: Quantity 12"
    },
    {
        "username": "Shahzad Syed",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Terrible network coverage and absolutely atrocious customer service with guaranteed hidden charges. For all researching please please do yourself a favor and literally chose ANY other provider.I sincerely did not want to give then 1 star but you can't write a review without clicking a star. I have lived in nz for 15 years and have yet to meet a happy Vodafone customer.  This is in addition to my own experiences listed above. Usually I forget about these things but gosh they deserve this review  Make your life simple...chose 2 degrees"
    },
    {
        "username": "dennis",
        "company": "Vodafone",
        "like_count": 1,
        "message": "this is Bull patties ,get out of voda .30 +years loyal to them. because i pay bill 1 day early by mistake ,not late but  early .they rip u off .8+ hours on ph still  no outcome. they ring u back for 1 sec hang up ,send tex to say they tried to call (bull patties) ,they make u ring back ,2 hours + on hold .not to mention get hung up. repeat ring them for hours.  WHAT A F'n JOKEBy the way, this if my first time in my 50year .to complain regards to any provider .NOW I HAVE MENTAL HELF PROBLEM ,because of them."
    },
    {
        "username": "Rob King",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Crap, poor online service, unable to complete transactions.... Still."
    },
    {
        "username": "Sophie r",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Westfield Newmarket staff very rude and unhelpful.Sat waiting for customer service for 40 minutes while staff did not say one word to me. Would have been okay to wait but no one even came upto me and said we’ll be with you in a minute. Extremely rude and unhelpful. Will be changing providers immediately and not purchasing another item"
    },
    {
        "username": "Abby Walker",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Celebrating as finally, after 3 years I have managed to get a simple account closure/transfer and refund back for mistaken billing sorted out and returned to me. At least I assume now that I have been able to submit a refund request it will actually be sent. Although I thought when I asked them to close my account 3 years ago, they'd do that too."
    },
    {
        "username": "Peter",
        "company": "Vodafone",
        "like_count": 1,
        "message": "We shut down our accounts with Vodafone about one year ago and ever since we have been getting charged an administration fee\" on a emailed CREDIT BALANCE. This has cost us approximately $25.00! Repeated contacts have failed to rectify the situation.\""
    },
    {
        "username": "Alex",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Customer service was appalling. 2 of the staff I spoke to (with Indian accents) were rude. Please get your personnel trained regarding standard customer service."
    },
    {
        "username": "sam pal",
        "company": "Vodafone",
        "like_count": 1,
        "message": "The wise internet provider beware. I have been with Vodafone for 28 years. They are money grabber with no service provider.  Dont get confused with fancy ads. The government is also a pussy and corporate puppet. Vodafone have no real technicians or people that know what they do. An outsourced brand with monopoly with chorus. They use another service for other service and other service making you confused. All of them are a way of part of legal corruption and confusion of customers. They have no other mission rather than pocketing money. I had internet interpretation every minute during Covit 19. The excuse was Covit 19 for Vodafone.  Non of thier staff work on the field so why they are part of Covit 19 shut down or reduced service?  Are they health workers? No. So shame on you Vodafone"
    },
    {
        "username": "Francesca",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Zero costumer support. After one year of constant chasing to solve a simple problem now it has been 4 months that I cannot manage to cancel my account! They don't pick up the phone and when they do they keep you at the phone for an hour, often the communication gets cut and still do not solve the problem. I still receive bills even though I moved to another company and I have contact them 3 times to beg them to close my account! These guys are still asking for money and I feel so powerless because there is literally no one that can help, no costumer support. Please do not join Vodafone, ever."
    },
    {
        "username": "Vaclav Novak",
        "company": "Vodafone",
        "like_count": 1,
        "message": "I just had another shocking experience with Vodafone customer service and billing department it is nearly impossible to explain how many times and how much trouble they caused to me in the past. I'm still with them because I always manage to get best deal at the end of long frustrating calls. I feel like I'm done with them now and will look for another provider when my term will be over. Hopefully there will be massive improvement before it happen."
    },
    {
        "username": "Ryan Ridderhof",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Great network absolutely horrific customer service, the call center is filled with friendly people who cant help you with anything, changing you address is a 3 week process that is so stressful that it makes being excited about moving into a new house impossible. Going into a store is no more helpful so don't bother with that.This company is set up to get new customers they are not interested in you after that. Don't be fooled by all the fancy deals you can get, its not worth the headache."
    },
    {
        "username": "D Plum",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Terrible. The customer service is truly awful. I have applied for some changes to my Vodafone account/plans etc. There are no confirmation emails.Its very hard to get through. Kept on hold. Redirected. Very hard to understand the person trying to help me ( we have different accents). Never given a time for the new services I applied for, just told it would occur within 3-7 or 3-5 working days. Rang again as there were no changes. Told wait two more days. Nope. Lol.Vodafone’s been so frustrating. I feel Im just being fobbed off and get a feeling too that Im just being a nuisance. They use to be great. Now they have lost my support. The online chat is a joke.I won’t phone again as it’s an ordeal."
    },
    {
        "username": "wcwano",
        "company": "Vodafone",
        "like_count": 1,
        "message": "If i could give zero stars, i most definitely would. The most useless internet provider in New Zealand. If you feel like talking to some indian on the otherside of the world who does not have a clue and you like to sit on hold for hours on end without getting anywhere then this internet provider is the one for you"
    },
    {
        "username": "Todd",
        "company": "Vodafone",
        "like_count": 4,
        "message": "I have been with Vodafone over 20 years.Just upgraded to HFC  Fibre X with them and all went very well.Downer Tech is a Kiwi and very caring at making sure all worked well before leaving the house after 2 hours . have 800 download and at least 100 upload most days.Managed to get a  deal for 1 year and transferring to  a Sky TV box ( from  Telstra Saturn box) rather than Vodafone Box as have heard too many issues with Vodafone Box.I did have one issue re the form going to Sky to change over as details were filled in wrong ..it was only after I spoke to NZ sounding voice person that it was corrected ( after 5 phone calls) I read most people are not happy so was a little worried at upgrading to Fibre X but being honest we are pretty happy with result."
    },
    {
        "username": "Sarah Caverly",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Been a customer with them for almost 6 months now. I call them weekly stating how my internet isnt working. Always 45mins-hour on hold. Internet is good for maybe max 2 days before it stops working and I have to call them again. You guys should really be paying my phone bill too for how many hours a week I spend on the phone with you guys."
    },
    {
        "username": "Karl",
        "company": "Vodafone",
        "like_count": 1,
        "message": "All well and good until literally anything goes wrong. Good luck getting even the smallest issue resolved they have literally the worst customer service I've ever experienced. My Sky box broke and Ive been calling them for over 2 months asking for a replacement to be sent out, spent countless hours on hold, every call takes at least 3 transfers and all information is lost between transfers so you have to start from scratch. Ive been told totally different stories by people on the same call and been lied to multiple times. If you stay on the line long enough sometimes you get a Kiwi and think you've hit the jackpot, they seem really friendly and helpful and refreshingly professional after the total incompetence of the off-shore call center but they won't actually do anything to solve your problem either. What a waste of time. Will be cancelling all of my services and moving to someone less awful. Avoid Vodafone at all costs, it's not worth it."
    },
    {
        "username": "GG",
        "company": "Vodafone",
        "like_count": 1,
        "message": "I was called and offered a cheaper monthly bill because I had been a loyal customer for several years. Was offered Vodafone TV, I said I didn't want it and I wasn't interested in it. The man on the phone said all good (in a roundabout way) and said my bill would go from $110ish to about $89 - from the top of my head. He said he would email me the contract. I never received a contract and didn't get a bill for nearly two months regardless of me emailing and asking for one. I still made my weekly payments so my credit was good. I receive a Vodafone TV in the mail...I finally get a bill emailed with a new account number and I am told I owe them $165...after half an hour waiting to speak to someone he explains I have not been paying my new account and while he transfers the money to my new account I am informed I should just pay the whole lot anyway, just to be safe. He then goes to tell me that after my 12 months runs out my bill will include an addtional $29.95 for the Vodafone TV box that I was sent and did not want, something the previous Vodafone Representitive never told me about, nor sent me the contract.He transferred me to another line to sort out the TV box problem and I am told the lines are too busy, ring back later and then I get hung up on.I send emails and get bullsh*t responses like provide us with the 'siebel account number, TPII simplex account number and legacy account number' - after I they have all my information. It's been months of frustration and I am switching provider.I will NEVER use Vodafone again and recommend everyone else to look elsewhere."
    },
    {
        "username": "Peter Scharmach",
        "company": "Vodafone",
        "like_count": 1,
        "message": "Just Bad, you stay in the line for ages, every time requesting youraccount no. there must be really problems in the management,or obviously making money to easy, so they are not keen to maintain their customers, they knowledge and service is by far unacceptable, just wondering why it is working fine with Vodafonein Europe? but here it was a big mistake to change to that provider.I can not recommend any person to shift the broadband serviceto Vodafone, its just a nightmare.if I need to write it in particular, it would take days....."
    },
    {
        "username": "wang",
        "company": "Vodafone",
        "like_count": 1,
        "message": "stay away, they TOOK YOUR MONEY without even telling you or getting your consent.I have $27 credit on my mobile account on the statement from Vodafone on Feb 2018, and next statement I received show only $2 credit left while I didn't use the sim card at all. contacted Vodafone, they said they started charging admin fee without even letting me know, and refused to refund me the money, this is rubbery!"
    },
    {
        "username": "Melo Mepieza",
        "company": "2degrees",
        "like_count": 1,
        "message": "An hour and a half waiting to be answered my call and still unsuccessful. They answered at last but huh  why hang up? Next time i will read reviews first. What a poor customer service. Waiting for 2 months for fiber connection and again waiting for another day to activate?Waiting for a year to be disconnected😮‍💨 i will never transact again to this company."
    },
    {
        "username": "Seabreeze",
        "company": "2degrees",
        "like_count": 3,
        "message": "A lot of great deals.2° shop can help with advice & tips but is not able to change Broadband plans or renew them for customers which is a shame as that would help make the most of staff in store.2° plan renewal on hold for 6mins which was reasonable and great it was short, great service and support.2° Technician service for Broadband:Transferred to 2° technician to get support with modem reset as the staff want me to go through it over the phone eventhough I've done it before (perhaps it's a bit different the process since the WiFi service has upgraded), I waited 1 hour for a technician, 3 times there was a pause of silence then back to music, it seemed like I was put back in a new quay or something, definitely need to up the staffing and train staff in store on the job to be technicians to support staff in person & over the phone including virtual calls to help patients troubleshoot.2° Broadband:Tried calling 3+ times waited 15+, 20+, 30+ mins. When I tried emailing, there was major delays and it took multiple emails also to other 2° services to get a response. It appears 2° is understaffed so, getting more staff would reduce waiting times over the phone and via email and help resolve issues.I still have WiFi reset to get done post 2° nationwide upgrade. I will try get 2° store to support me with managing apps to install the new 2° Broadband app that will allow me to manage my transactions."
    },
    {
        "username": "Qasim Majeed",
        "company": "2degrees",
        "like_count": 1,
        "message": "The worse costumer service ever waiting time over one hour and half , no options to call back , very very stressful to join with them , plus coverage is not good at all , normal calls ( which is no WiFi )disconnected if u move from your WiFi 10 meters , that is for my house and my business ( both same issues )Next day I was waiting for 34 minutes, then they disconnected the line ( sooooo much stress)"
    },
    {
        "username": "Chris Bly",
        "company": "2degrees",
        "like_count": 1,
        "message": "Have been on hold for over two hours so far, in another 5 minutes their call centre closes.What do you think my chances are?Broadband has been running slow for 3 days now.Yesterday I ported to mobile numbers to them and they stuffed up both of them"
    },
    {
        "username": "Diane Fraser",
        "company": "2degrees",
        "like_count": 1,
        "message": "I am sick to the back molars with 2 degrees.... It is so bad.... If you can manage to top up\" with your credit card.... Lucky you.... I tried 15 times.... NO EXAGERRATION.. The automated service wouldn't allow me to give my Credit Card number.Eventually I was able to top up...EXCEPT I WASN'T TOPPED UP.... AGAIN....This has happened so many times.... What a shocking service.Never ever had a single problem with Optus in Australia.Never had a problem... EVER with Etisalat in Abu Dhabi. So here I am in New Zealand. Get a serious grip. I am changing providers..... Even although its an inconvenience\""
    },
    {
        "username": "Daisy",
        "company": "2degrees",
        "like_count": 1,
        "message": "Really bad experience on them, the the customer service has really bad ability on dealing with problems. Every problem I had to call twice then they can able to deal with and each call is 2hr+ for waiting. Poor broadband connection (my old skinny one is much better). All the things are worse. Never choose again"
    },
    {
        "username": "R V",
        "company": "2degrees",
        "like_count": 1,
        "message": "Worst Service provider in NZ. Horrible wait time. The manager made an error on my account. Been struggling for 3 months to get it sorted and today they restricted my services due to their incompetence. Stick with Vodafone!!!"
    },
    {
        "username": "Zachary Weston",
        "company": "2degrees",
        "like_count": 1,
        "message": "Terrible. Got issued a bill for something I was assured I wouldn't have to pay, I called customer service MULTIPLE times and have been left on hold for hours! I am so fed up with this pathetic excuse of a company"
    },
    {
        "username": "tanyia gray",
        "company": "2degrees",
        "like_count": 1,
        "message": "Bad customer service all round.  I've been waiting now nearly 3hrs for someone.   Why is this happening."
    },
    {
        "username": "Ashleigh Palmer",
        "company": "2degrees",
        "like_count": 1,
        "message": "I signed up for the 2degrrese broadband, they have a modem and app system to get connected with a manual on steps how to do it. I went through the steps and for some reason it wasn't working, I looked at their trouble shooting tips and they also didn't work.  I sat on the 0800 number for more than an hour 3 different occasions and couldn't waste any more time of my day waiting to have my call answered. I found an email address, which wasn't easily found, sent them an email, had no response via email, had a phone call from someone while I was at work so obviously couldn't receive their help, I asked for the manager as I wasn't happy with their service and was contemplating continuing the contract given how disappointing the first two weeks had been. (During this time I was sent two bill invoices)  A few days later sent another email as no follow up call had happened, 4 days later I got a response which went to my spam folder.  I heard nothing and received a postage bag to send the modem back so I assumed my wishes in the email were being met. A couple weeks later get a cancellation fee withdrawn from my account Of $230 (not a small sum). Once I noticed the withdrawal I went in store and complained, they pretty much blamed me for not responding to their one call while I was at work and said because they had made efforts that weren't met back by me the cancelation fee still stands. I signed up to Vodafone broadband and was connected to the internet that day, I had trouble connecting the modem, called their help line and was answered within 5 minutes with a helpful person on the other end. The service in comparison is greatly different and two degrees service is unacceptable. No efforts were made to come to an agreement or resolution of the problem. Suggestions: have someone assigned to an account problem so it actually seems like you care that your customers need help if they're not connected. Have a callback option on your support line. make your email address easier to find on your web sight. Have an email address that doesn't go to the spam folder, my bill emails don't go to that inbox so why would the real person emails go there. Fix your reception, I'm in the middle of Hamilton city and get one to two bars at my house! I had better service living 45 minutes out of town in the country side."
    },
    {
        "username": "PETER COX",
        "company": "2degrees",
        "like_count": 5,
        "message": "I had problems with my pre-paid mobile as it had not properly activated on my arrival from Australia to New Zealand. William in the Nelson 2degrees store spent a lot of time with me (supported by a couple of calls to his manager who was on a day off as it was Sunday) and sorted my issue to my satisfaction. My previous efforts to get support by texts and emails had not been successful, but William's service was exemplary."
    },
    {
        "username": "Craig Arnold",
        "company": "2degrees",
        "like_count": 1,
        "message": "I have had enough of this service provider, so I have since switched. Due to the lack of customer service. Sort yourself out!!!! Before you lose a lot more business."
    },
    {
        "username": "Andrew",
        "company": "2degrees",
        "like_count": 1,
        "message": "One of the worst telco companies I have ever dealt with. Call centre is non-existent, messages never get replied to - I am left without internet due to their incompetent management. Definitely look elsewhere for Broadband/Mobile, it's not worth your time or money using these clowns."
    },
    {
        "username": "Jason Haworth",
        "company": "2degrees",
        "like_count": 1,
        "message": "Very painful the worst company ever. This is a warning do not go with 2degress Broad Ban or Mobile. All they want is your money, when issues come they don't want to know about it. I'm over the bull crap and such poor customer service. I highly recommend not to go with 2degress. If you want to be taken for a ride go ahead and get poor bad incompetent service."
    },
    {
        "username": "Jimmy Batchelor",
        "company": "2degrees",
        "like_count": 1,
        "message": "Legitimately the worst telco in New Zealand, which is sad because they used to be great. What happened 2Degrees?I made an online order for a phone and account plan, waited a week without hearing anything about it. So I called in and was told it would ship any day. I called again three days later and was told the account had been flagged for fraud and I needed to contact the fraud team. Why didn't the fraud team contact ME? Aren't I the customer? The one trying to spend money with your company? Rediculous.So I asked for an email, the lady said she'd text it to me. She didn't.So I called again the same day, get a different service rep, and THIS one tells me that my order was outright CANCELLED by the fraud team the DAY AFTER MY INITIAL ORDER. Why didn't person one or person two tell me this?So I go into a retail store thinking I can just get it sorted in person, account is flagged again, and cancelled by the fraud team. Though this time they were kind enough to let me know. Just that it had been cancelled by the way - no reasons as to why.So I went to Spark and got a phone & plan same day without any issue. We have great credit - well we did. After having to get multiple credit checks done by 2D and then Spark - it's likely that my score has tanked.It gets better though, this entire saga happened two months ago and 2Degrees continues to send me emails saying I owe them $80 for an account that was cancelled next day and for a device I never received. This is despite their CS team assuring me in writing via email that there is no amount owing on my account. The level of ineptitude at 2Degrees is mind boggling - stay away."
    },
    {
        "username": "Richard Greendale",
        "company": "2degrees",
        "like_count": 1,
        "message": "what once was a decent broadband provider has become absolutely useless. support is basically non existent. waiting times for simple questions about contracts are about 1 full week! stay away from this company, they're going down if they carry on like that"
    },
    {
        "username": "J Linn",
        "company": "2degrees",
        "like_count": 4,
        "message": "Signed up with Two Degrees helped by Tom, all great, explained everything and job done. SIM cards for cell phones arrived within two days. On the third day the modem arrived. Though they wanted to do start up on Monday, I asked them to wait til Tuesday. On Thursday the wifi was up and running Very simple just plugged it in and good to go. By Thursday all three of our cells phone numbers were brought over from Slingshot (we were keeping our numbers) Liam was Very helpful when I had a problem with my useless iPhone and spent time on the phone helping me to reset a bunch of stuff. And on Saturday I was finally watching the rugby LIVE (6 months Free SkySport) Cant say enough about these people, only wish I had dumped Slingshot Much sooner!!"
    },
    {
        "username": "Nick",
        "company": "2degrees",
        "like_count": 1,
        "message": "Poor service. Sent bills to wrong people and recieved the wrong bill with somebody else's details. CSR requests ignored and unable to get further assistance. Awful service and company to be avoided."
    },
    {
        "username": "G Man",
        "company": "2degrees",
        "like_count": 1,
        "message": "Do not under any circumstances sign up with any service offered by this company\"You will regret it.\""
    },
    {
        "username": "Victoriana laza",
        "company": "2degrees",
        "like_count": 1,
        "message": "They are rip off...I have bought a phn with them and I paid off after few months later and cancel the plan aswell ...few weeks back I have check my account they have been charging my account for over 3 month me without notice it ..so I rang them and they said there's no refund for it as it's electronics of shi*t whatever so I cancel my number and everything that under 2 degree.. bad customer service as the staff as well at Lynn mall branch...they are useless ...no wonder y Vodafone is the best as they are for people while this ugly services rip off people alive.will never used this damn  service."
    },
    {
        "username": "Barry P",
        "company": "2degrees",
        "like_count": 1,
        "message": "My main issue with 2 degrees Broadband is the terrible cheapie Fritz\" modem router that they give you (which is virtually mandatory if you also want a home phone). The wireless range is terrible"
    },
    {
        "username": "Shannyn Turnbull",
        "company": "2degrees",
        "like_count": 1,
        "message": "I'm sick of 2degrees broad ban internet. Cuts out all the time. Ring them up an wait two hours on the phone. An never get results. It's bloody annoying when u have work to do or kids home work. Would never ever recommend 2degreea to anyone."
    },
    {
        "username": "Mau Si'i Meafoou Unga",
        "company": "2degrees",
        "like_count": 1,
        "message": "I am not happ as they took my money from my bank account to been a week no confirmation I been contacted them millions time asking for my refund they said it doesn't show they took the money... Aredy send a proof from my bank . I emailed the account department they block my email 😠.. Very unprofessional.. Very not happy and I won't stop until I get my money back."
    },
    {
        "username": "mohammed haroon",
        "company": "2degrees",
        "like_count": 5,
        "message": "Superb communication, easy and clear instructions to follow.Great customer service, polite and professional.Really appreciate your help , thanks Ian and 2degrees team 😊"
    },
    {
        "username": "Kristine Drury",
        "company": "2degrees",
        "like_count": 5,
        "message": "Satisfied customerI recently purchased a phone through 2 degrees and couldn’t be happier.  The Hornby branch personnel went above and beyond to make sure that my new phone was up and running for me to use. A+++"
    },
    {
        "username": "barry liu",
        "company": "2degrees",
        "like_count": 1,
        "message": "Disastrous experience over the 4 years of using 2 degrees, just recently transferred to Vodafone. 2 Degrees continues to deduct my money without my permission after I transfer to Vodafone."
    },
    {
        "username": "Kirsty Bromley",
        "company": "2degrees",
        "like_count": 1,
        "message": "My friend gave me a gift of 1GB using the online top up option. She put my number in to receive the gift. 2degrees then set up a 1GB data pack on my account using MY BANK CARD!! $40 taken from my account and they’re refusing to refund because I used the data even though I DIDNT SET ANYTHING UP! Also, I share data with my partner each month from his plan and they haven’t given it to me this month despite it saying on my partners account that it’s being shared. Still on hold to 2degrees and it’s been over an hour. ON MOTHERS DAY!!! Absolute theft. Refusing to refund money that THEY STOLE!! Shocking. A 3rd person should not be able to set up auto payments on someone else’s account when all they are doing is gifting a set amount of data. Day. light. robbery."
    },
    {
        "username": "Nick Lawson",
        "company": "2degrees",
        "like_count": 1,
        "message": "Absolutely the worst ever customer service I've ever experienced, Truely shocking! Rude employees and made countless mistakes. Terrible."
    },
    {
        "username": "Aman Deep Singh",
        "company": "2degrees",
        "like_count": 1,
        "message": "Hello,I bought Harman kardon Allure from your store for $279 and it doesnt respond to our voice I called your contact centre the person doesnt even know anything about it and asked me to go to the nearest 2 degrees store I went to the st lukes one because I live in avondale and they asked me to go the city store because I bought it from there. I am not going to city just to get the speaker checked. I want a full refund of the speaker or else a replacement but I am not going to go to the city for something which should have been working fine in the first go."
    },
    {
        "username": "Ashley",
        "company": "Spark",
        "like_count": 1,
        "message": "Terrible, I brought my husband and I samsung watches. On our shared account, I went in on my own and got them on our plan. My watch overheated and froze within 2 weeks, it only works for 3 hours at a time  it took 4 months for them to return from the technician and still has same problem. Now I want to cancel the plans but I can't unless my husband does it for me. I can't understand I feel so ripped off. Also his watch won't connect withought his phone on him which is what the plan is supposed to be for so we can usd them withought our phones for sport ect. Useless."
    },
    {
        "username": "Recycled Wood Turner",
        "company": "Spark",
        "like_count": 1,
        "message": "Their service is so bad 25 minutes holding on till the call was answered. Then after talking for 30 minutes we were told they would email there service people to see if they could fix the problem.  Two days later we got and email to say the problem was fixed. Call was answered from overseas the service team is in NZ. So emailing is the only way they contact each other."
    },
    {
        "username": "Matt Taylor",
        "company": "Spark",
        "like_count": 1,
        "message": "Spark spot is a truly dreadful app. On a new top of the range LG tv with gig fibre connection it is like watching a torrent steam 2005 - encoding issues, stuttering,stops, switching between content crashes the app so you have to reboot the tv.  Just ruined the start of the FPL season.  Generally the f1 content is now ok (if it will play) but then that provided by Sky who know how to do this.  Please, please hand your rights to a company who can make use of them to give a customer service."
    },
    {
        "username": "Bronwyn Harrichandparsad",
        "company": "Spark",
        "like_count": 1,
        "message": "Should have read this before porting over.....what a nightmare for such a simple query. 5 emails and 3 store visits later still no joy! Unbelievable really. No excellence in service"
    },
    {
        "username": "Richard E",
        "company": "Spark",
        "like_count": 1,
        "message": "I wrote into Google, Why is NZ Spark so useless?\" and it put me onto this page. I'm trying to find out about Data Roaming for when travelling overseas. It's chatbot said it didn't understand my question and would I like to go through to a real person. I said yes but it just cycled around the same question. So I tried logging into the app but it wouldn't accept my password"
    },
    {
        "username": "TokeCity",
        "company": "Spark",
        "like_count": 1,
        "message": "spark is pulling a dirty money grab with anyone who wants to remove their phone line. my grandmother wanted to get rid of her homephone she was informed there would be a charge to swap over, sure okay that seems reasonable. she wasn't informed how much the charge would be.tonight she opened a letter with a bill of $242 when i was on the phone with them they said it was to cover the previous 2 months of internet, she is direct debited and its always paid on time.this feels like a stop loss pulled by a spark as more and more people ditch the home phone, that stop loss just turned into a lost customer.(btw) i tried to get a refund or match internet speeds with my republic, but they didn't have a single bone to throw me.don't waste your money. cancel your entire plan with spark and go with someone else if you want to ditch your homephone"
    },
    {
        "username": "Charli zhang",
        "company": "Spark",
        "like_count": 1,
        "message": "Some of their stuff are unprofessional. They try to EDUCATE you instead of helping you. They don’t care about the customer satisfaction at all. They only say what they wanna say and blame you"
    },
    {
        "username": "Tama Schimanski",
        "company": "Spark",
        "like_count": 1,
        "message": "Shocking customer service. Spend half the time trying to find a number just to be sent online to be ignored. Will be swapping providers in Feb."
    },
    {
        "username": "Hannah Saywell",
        "company": "Spark",
        "like_count": 1,
        "message": "This company is awful! Don’t sign up with them! Customer service is a 0. They took $20 out of my account for no reason. If your going to choose any phone provider, don’t choose this one."
    },
    {
        "username": "Sugandha Dhar",
        "company": "Spark",
        "like_count": 1,
        "message": "Screw you spark ever since doing digital and removing the customer service team youve scrwed customers over ive been a loyal customer for years so why is that i top 30 dollars and you take dollar off me sk i cant use that to buy my value pack oh but you get the extra money from me scamming pillocks avoid il be chaning to voda or 2degrees"
    },
    {
        "username": "Waiz",
        "company": "Spark",
        "like_count": 1,
        "message": "This company dont deserve even 1 star had to ring up almost 3-4 times just to process my refund that a thought i already did on monday the 17th rang up the first time and got hunged up on! And then rang up again yesterday to see where my refund was at and yet it hadnt been processed or assisted at all!!! Until i rang up again today which he told me and had to do it all over again then finally just sorted it today as it left me overdue in my bank acc"
    },
    {
        "username": "Shawn Minnie",
        "company": "Spark",
        "like_count": 1,
        "message": "Pathetic service. I believe that they have charged me more than the broadband usage i used and they refuse to supply me with the info on my usage. Absolutely useless. Stay way."
    },
    {
        "username": "Sam Dinnan",
        "company": "Spark",
        "like_count": 1,
        "message": "Left ages ago when I realised if you run out of data on your mobile plan, they’ll automatically take $1 from your account for every extra 10MB you use. Usually they don’t  even tell you you’re low on data until they’ve already charged you. Hope this has been fixed for newer customers but I’ll never go back on a prepay plan unless I’m forced."
    },
    {
        "username": "George Thony",
        "company": "Spark",
        "like_count": 1,
        "message": "We got a chorus technician out via spark in November last year to re connect our copper cable in our office.  Not only did he fail to connect it. He left it hanging out of the telephone jack for the world to see. When we called spark asking them to send someone to fox it, they just ran us in circles and this continued for the past 10 months up till last week, where instead of fixing the wire in our office they disconnected the copper wire connection entirely. Now instead of paying $90 for internet in the wrong part of the house we are paying for no internet at all and are still being run in circles trying to fix it. If there was another service provider in our area we would change in a heartbeat."
    },
    {
        "username": "Steve Mawdsley",
        "company": "Spark",
        "like_count": 1,
        "message": "Just been cut off from rural broadband with no warning. Talk about looking after you with the Corona virus, absolutely disgusting service"
    },
    {
        "username": "TS-UK",
        "company": "Spark",
        "like_count": 1,
        "message": "Arrived from the UK with TP-Link M7350 mobile WiFi device which I have used successfully with local sim cards in Ireland, Finland and the Czech Republic. Obtained a sim card ($49) from Spark in Auckland. Unable to check that it worked as I hadn't had time to charge the device since landing 24 hours earlier. Later the installed sim produced a device message of 'unknown provider' and refused to connect to the internet. Took it back to the Spark shop where (a different) salesperson  looked totally bewildered and said the problem was probably the device 'operating on different frequencies than are used here'. Wouldn't refund the price of the sim as it was pre-paid. Found the manager who then checked the compatibility of their sim cards with the M7350-they weren't. She still refused to refund the sim card price. Went across the street to Vodaphone and obtained a sim card ($40) that does work. So summary of Spark: sales staff who know feck all and managers who don't give a toss; probably explains the overall Trustpilot rating. For any New Zealanders reading this - be thankful you have a decent rugby team because if Spark is an example of Kiwi expertise, technology & customer service you are in big trouble!"
    },
    {
        "username": "Matt",
        "company": "Spark",
        "like_count": 1,
        "message": "Shittest service I have ever had, internet goes down. Spark not us you have to get new modem\" ok ask for modem"
    },
    {
        "username": "Jenelyn Capucao ",
        "company": "Spark",
        "like_count": 1,
        "message": "When you think you have paid your bill in full, think again! Coz spark will send you another bill at the end of the month with out telling you what it is for. Appalling customer service too! So disappointed dealing with this people. You have to go all the way to their shop to know what was your bill about! Ridiculous!"
    },
    {
        "username": "Daniel ",
        "company": "Spark",
        "like_count": 5,
        "message": "Reliable 4G network. Ponsonby store was very friendly."
    }
]